{
  "backend/main.mo": "Motoko backend with access control that stores user profiles and manages contact requests with admin‑restricted queries.",
  "feature_evidence.json": "Feature evidence listing implemented frontend files, components, and test mappings for several app features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode values, and global element styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the root React app with metadata for the site.",
  "frontend/src/App.tsx": "Main React app with hash‑based routing, header/footer, admin page access, and profile setup prompt.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guard component that checks authentication and admin role, showing appropriate fallback screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with loading and error recovery logic.",
  "frontend/src/components/auth/ProfileSetupPrompt.tsx": "Modal prompting new users to save their profile name before continuing.",
  "frontend/src/components/forms/RequestErrandForm.tsx": "A form component that collects errand request details, validates input, composes a message, and submits it via a custom hook with success handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding, quick navigation links, contact info, and a credits bar with dynamic year and referral link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with logo, navigation buttons, mobile menu, and identity-aware admin/login controls, including smooth scrolling behavior.",
  "frontend/src/components/sections/ContactSection.tsx": "Section containing contact information and the request form, structured with a two-column layout on large screens.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero section with headline, description, call-to-action buttons, and a hero image.",
  "frontend/src/components/sections/HowItWorksSection.tsx": "Section showing three steps of the service process with icons, titles, and descriptions.",
  "frontend/src/components/sections/ServicesSection.tsx": "Services listing with cards for each offering and a button to scroll to the contact form, optionally preselecting a service.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on identity, initializing access control and invalidating dependent queries when changed.",
  "frontend/src/hooks/useAdminRequests.ts": "React Query hooks for fetching and mutating admin contact requests and user profile/role data via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles identity loading, login, logout, and status management.",
  "frontend/src/hooks/useSubmitContactRequest.ts": "Mutation hook to submit a new contact request through the actor and invalidate related queries.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, typography, dark mode, and utility classes.",
  "frontend/src/main.tsx": "App entry point that initializes React Query and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/AdminRequestsPage.tsx": "Admin UI for listing, sorting, and viewing details of contact requests with loading and error states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page assembling hero, overview, services, workflow, and contact sections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, layout, and animations with custom variables and plugins.",
  "project_state.json": "Tracks project state, required images, and a list of existing features for a delivery-service introduction app. Includes metadata such as schema version, project version, and architectural notes."
}